package com.example.tickersapp12.fichi;

public class VirtualBroker {
    // В бд хранится информация о купленных акциях
    // Пользователь сам выбирает какую комиссию с него снимают. По умолчанию предлагается выбрать комиссию как в крупных банка (0,3 тинькофф , 0,05 открытие, ... )
    // В базе хранится цена покупки и продажи. Пока не продали в поле продажи --
    // После продажи заносим в поле цену продажи и фиксируем прибыль/убыток
    // Прибыль/убыток так же хранится в бд
    // Можно посмотреть историю операций покупки/продажи. При желании пользователь может её удалить (удаляем из бд)
    // Внизу показана прибыль за все время


}
